fall2023/psyc5316/psyc5316-fall2023.tex
% Created 2023-08-11 Fri 08:42
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}
\setlength{\parindent}{0pt}
\setlength{\parskip}{2mm}
\date{Fall 2023}
\title{PSYC 5316: Advanced Quantitative Methods \& Experimental Design}
\hypersetup{
 pdfauthor={},
 pdftitle={PSYC 5316: Advanced Quantitative Methods \& Experimental Design},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Contact info}
\label{sec:orga0a8406}
\begin{itemize}
\item Professor: Thomas J. Faulkenberry, Ph.D
\item Office: Math 301
\item Office hours: \emph{TBA}
\item Email: faulkenberry@tarleton.edu
\item Website: \url{http://tomfaulkenberry.github.io}
\item Phone: 254-968-9816
\end{itemize}

\section*{Course description}
\label{sec:org084024b}

This course is designed to teach you the advanced quantitative methods and techniques of experimental design that are necessary to read and conduct modern empirical research in the behavioral sciences. We will do this through replicating three classic experiments, each illustrating a unique experimental design and technique for data analysis.  Students taking this course are expected to have \textbf{previously} taken a graduate level course in statistics (or equivalent statistical training). 

Some of the specific skills you'll learn this semester are:
\begin{itemize}
\item using a computer to program behavioral experiments and collect response time data
\item efficiently pre-processing raw data and implement sophisticated statistical models using R
\item writing technical manuscripts to report results of experiments
\end{itemize}

\section*{Course materials}
\label{sec:orgb60920c}

There is no required textbook for the course. However, I recommend you have access to a good statistics textbook (\href{https://www.amazon.com/Psychological-Statistics-Basics-Thomas-Faulkenberry-dp-1032020954/dp/1032020954}{mine} is cheap). In addition, you'll need to have access to a computer (laptop is best) on which you can install the following software packages:

\begin{itemize}
\item R statistical software (free download from \href{http://www.r-project.org}{https://www.r-project.org})
\item RStudio (free download from \href{http://www.rstudio.com}{https://www.rstudio.com})
\item OpenSesame (free download from \url{https://osdoc.cogsci.nl/}
\end{itemize}

\section*{Student learning outcomes}
\label{sec:orgc8d1939}

\begin{enumerate}
\item perform and interpret basic techniques of statistical inference, both in a frequentist and Bayesian framework
\item program and administer behavioral experiments using computer software
\item understand various methods of cleaning data for analysis in R
\item develop skills for communicating technical material, especially through writing scientific manuscripts in APA format.
\end{enumerate}

\section*{Requirements and grading}
\label{sec:orgdd8a9ba}

You will complete four lab activities throughout the semester. With the exception of the first lab on how to use R, the labs will each take four weeks, following the same basic schedule:

\begin{itemize}
\item first week: you will watch a video lecture describing to build the experiment in OpenSesame, then build your own version and submit it to me for a grade (10 points)
\item second week: you will ask four friends to participate in your experiment, collect their data, and submit it to me for a grade (20 points)
\item third week: you will watch a video lecture describing how to use R to analyze the collected data from the class, then complete and submit a corresponding data analysis assignment for a grade (30 points)
\item fourth week: you will write a short APA-formatted manuscript describing the experiment and the results, and submit for a grade (40 points)
\end{itemize}

The labs I've planned for this semester are as follows:

\begin{itemize}
\item Lab 1 - Introduction to R statistical software
\item Lab 2 - flanker task (an experiment on attention)
\item Lab 3 - Sternberg memory scanning task (an experiment on short term memory)
\item Lab 4 - addition verification task (an experiment on mathematical cognition)
\end{itemize}

Lab 1 is worth 50 points, and Labs 2-4 are each worth 100 points. Grades will be assigned based on the percentage of points you accumulate out of a total possible 350 points.  I will use the standard grading scale of A=90\%, B=80\%, etc.

\section*{Course Communication}
\label{sec:org2854aac}

This course is designed to be an intensive, interactive course on modern statistical methods and experimental design.  That means that I will be available for one-on-one consultation most any time.  Just stop by my office or give me a call.

All official course communication (questions, setting up a meeting, etc.) will be conducted by email.  Any time you need to contact me, feel free to send me an email at faulkenberry@tarleton.edu.  I only ask that you adhere to two guidelines:
\begin{itemize}
\item please include the course number (PSYC 5316) in the subject line.  For example, one good way to do this is:  Subject: [PSYC 5316] Question about problem set 3
\item please use proper email etiquette.  Include a salutation (e.g., Dear Dr. Faulkenberry), complete sentences, and a closing (e.g., "Regards, Your Name").  You might be surprised how many times I get an email from a nondescript email address with no indication from WHOM the email was sent!
\end{itemize}

Note, I will send periodic class announcements via Canvas messaging. However, I ask that you send your questions by email instead of Canvas messaging. 

\section*{Academic Integrity Statement and Policy}
\label{sec:orgbf7f827}

Cheating, plagiarism, or doing work for another person who will receive academic credit is impermissible. This includes the use of unauthorized books, notebooks, or other sources in order to secure or give help during an examination, the unauthorized copying of examinations, assignments, reports, or term papers, or the presentation of unacknowledged material as if it were the own work. Disciplinary action may be taken beyond the academic discipline administered by the faculty member who teaches the course in which the cheating took place. Consult the following links for further information on academic conduct. 
\begin{itemize}
\item Student Judicial Affairs: \url{https://www.tarleton.edu/judicial/academicconduct.html}
\item Student Handbook: \url{https://www.tarleton.edu/studentrules/code-of-student-conduct.html}
\end{itemize}

\section*{Americans with Disabilities Act (ADA) - Student Success}
\label{sec:org26612ac}

Tarleton State University is committed to complying with the Americans with Disabilities Act (www.ada.gov) and other applicable laws. If you are a student with a disability seeking accommodation for this course, please contact the Office of Disability Resources at 254.968.9400, disability@tarleton.edu, or visit \url{https://www.tarleton.edu/drt/}.  

\section*{Academic Affairs Core Values in the Classroom}
\label{sec:org72051e9}

\subsection*{Academic Integrity}
\label{sec:orgc13a6d1}
Tarleton State University's core values are integrity, excellence, and respect. Central to these values is integrity, which is maintaining a high standard of personal and scholarly conduct. Academic integrity represents the choice to uphold ethical responsibility for one’s learning within the academic community, regardless of audience or situation.

\subsection*{Academic Excellence}
\label{sec:org2171ab3}
Tarleton holds high expectations for students to assume responsibility for their own individual learning.  Students are also expected to achieve academic excellence by:
\begin{itemize}
\item honoring Tarleton’s core values.
\item upholding high standards of habit and behavior.
\item maintaining excellence through class attendance and punctuality.
\item preparing for active participation in all learning experiences.
\item putting forth their best individual effort.
\item continually improving as independent learners.
\item engaging in extracurricular opportunities that encourage personal and academic growth.
\item reflecting critically upon feedback and applying these lessons to meet future challenges.
\end{itemize}

\subsection*{Academic Respect}
\label{sec:org4dd0b8f}
Students are expected to interact with professors and peers in a respectful manner that enhances the learning environment. Professors may require a student who deviates from this expectation to leave the face-to-face (or virtual) classroom learning environment for that particular class session (and potentially subsequent class sessions) for a specific amount of time. In addition, the professor might consider the university disciplinary process (for Academic Affairs/Student Life) for egregious or continued disruptive behavior.


\subsection*{Student Rules}
\label{sec:orge8f8f46}
Students are responsible for knowing and abiding by the policies and information contained in the Tarleton Student Rules - \url{https://www.tarleton.edu/studentrules}.  

\textbf{Note:  any changes to this syllabus will be communicated to you by the instructor!}

\section*{Tentative schedule}
\label{sec:orgf2bab2f}

\begin{center}
\begin{tabular}{rll}
Assignment & Due Date & Topics covered\\
\hline
1 & 9/3 & Lab 1.1: installation and the basics of R\\
2 & 9/10 & Lab 1.2: performing basic statistical tests in R\\
3 & 9/17 & Lab 2.1: programming the flanker task\\
4 & 9/24 & Lab 2.2: collecting data from the flanker task\\
5 & 10/1 & Lab 2.3: analyzing the flanker data\\
6 & 10/8 & Lab 2.4: writing the flanker manuscript\\
7 & 10/15 & Lab 3.1: programming the Sternberg memory scanning task\\
8 & 10/22 & Lab 3.2: collecting data from the Sternberg task\\
9 & 10/29 & Lab 3.3: analyzing the Sternberg data\\
10 & 11/5 & Lab 3.4: writing the Sternberg manuscript\\
11 & 12/3 & Lab 4.1: collecting data for the addition verification task\\
12 & 12/10 & Lab 4.2: analyzing the addition data\\
\end{tabular}
\end{center}
\end{document}